Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13124.h
// Register: CRCOUTU
#define CRCOUTU CRCOUTU
extern volatile unsigned char           CRCOUTU             __at(0x1CA3);
#ifndef _LIB_BUILD
asm("CRCOUTU equ 01CA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OUT                    :8;
    };
    struct {
        unsigned OUT16                  :1;
        unsigned OUT17                  :1;
        unsigned OUT18                  :1;
        unsigned OUT19                  :1;
        unsigned OUT20                  :1;
        unsigned OUT21                  :1;
        unsigned OUT22                  :1;
        unsigned OUT23                  :1;
    };
} CRCOUTUbits_t;
extern volatile CRCOUTUbits_t CRCOUTUbits __at(0x1CA3);
// bitfield macros
#define _CRCOUTU_OUT_POSN                                   0x0
#define _CRCOUTU_OUT_POSITION                               0x0
#define _CRCOUTU_OUT_SIZE                                   0x8
#define _CRCOUTU_OUT_LENGTH                                 0x8
#define _CRCOUTU_OUT_MASK                                   0xFF
#define _CRCOUTU_OUT16_POSN                                 0x0
#define _CRCOUTU_OUT16_POSITION                             0x0
#define _CRCOUTU_OUT16_SIZE                                 0x1
#define _CRCOUTU_OUT16_LENGTH                               0x1
#define _CRCOUTU_OUT16_MASK                                 0x1
#define _CRCOUTU_OUT17_POSN                                 0x1
#define _CRCOUTU_OUT17_POSITION                             0x1
#define _CRCOUTU_OUT17_SIZE                                 0x1
#define _CRCOUTU_OUT17_LENGTH                               0x1
#define _CRCOUTU_OUT17_MASK                                 0x2
#define _CRCOUTU_OUT18_POSN                                 0x2
#define _CRCOUTU_OUT18_POSITION                             0x2
#define _CRCOUTU_OUT18_SIZE                                 0x1
#define _CRCOUTU_OUT18_LENGTH                               0x1
#define _CRCOUTU_OUT18_MASK                                 0x4
#define _CRCOUTU_OUT19_POSN                                 0x3
#define _CRCOUTU_OUT19_POSITION                             0x3
#define _CRCOUTU_OUT19_SIZE                                 0x1
#define _CRCOUTU_OUT19_LENGTH                               0x1
#define _CRCOUTU_OUT19_MASK                                 0x8
#define _CRCOUTU_OUT20_POSN                                 0x4
#define _CRCOUTU_OUT20_POSITION                             0x4
#define _CRCOUTU_OUT20_SIZE                                 0x1
#define _CRCOUTU_OUT20_LENGTH                               0x1
#define _CRCOUTU_OUT20_MASK                                 0x10
#define _CRCOUTU_OUT21_POSN                                 0x5
#define _CRCOUTU_OUT21_POSITION                             0x5
#define _CRCOUTU_OUT21_SIZE                                 0x1
#define _CRCOUTU_OUT21_LENGTH                               0x1
#define _CRCOUTU_OUT21_MASK                                 0x20
#define _CRCOUTU_OUT22_POSN                                 0x6
#define _CRCOUTU_OUT22_POSITION                             0x6
#define _CRCOUTU_OUT22_SIZE                                 0x1
#define _CRCOUTU_OUT22_LENGTH                               0x1
#define _CRCOUTU_OUT22_MASK                                 0x40
#define _CRCOUTU_OUT23_POSN                                 0x7
#define _CRCOUTU_OUT23_POSITION                             0x7
#define _CRCOUTU_OUT23_SIZE                                 0x1
#define _CRCOUTU_OUT23_LENGTH                               0x1
#define _CRCOUTU_OUT23_MASK                                 0x80

// Register: CRCSHFTU
#define CRCSHFTU CRCSHFTU
extern volatile unsigned char           CRCSHFTU            __at(0x1CA3);
#ifndef _LIB_BUILD
asm("CRCSHFTU equ 01CA3h");
#endif
// aliases
extern volatile unsigned char           CRCSHIFTU           __at(0x1CA3);
#ifndef _LIB_BUILD
asm("CRCSHIFTU equ 01CA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT16                :1;
        unsigned SHIFT17                :1;
        unsigned SHIFT18                :1;
        unsigned SHIFT19                :1;
        unsigned SHIFT20                :1;
        unsigned SHIFT21                :1;
        unsigned SHIFT22                :1;
        unsigned SHIFT23                :1;
    };
} CRCSHFTUbits_t;
extern volatile CRCSHFTUbits_t CRCSHFTUbits __at(0x1CA3);
// bitfield macros
#define _CRCSHFTU_SHIFT_POSN                                0x0
#define _CRCSHFTU_SHIFT_POSITION                            0x0
#define _CRCSHFTU_SHIFT_SIZE                                0x8
#define _CRCSHFTU_SHIFT_LENGTH                              0x8
#define _CRCSHFTU_SHIFT_MASK                                0xFF
#define _CRCSHFTU_SHIFT16_POSN                              0x0
#define _CRCSHFTU_SHIFT16_POSITION                          0x0
#define _CRCSHFTU_SHIFT16_SIZE                              0x1
#define _CRCSHFTU_SHIFT16_LENGTH                            0x1
#define _CRCSHFTU_SHIFT16_MASK                              0x1
#define _CRCSHFTU_SHIFT17_POSN                              0x1
#define _CRCSHFTU_SHIFT17_POSITION                          0x1
#define _CRCSHFTU_SHIFT17_SIZE                              0x1
#define _CRCSHFTU_SHIFT17_LENGTH                            0x1
#define _CRCSHFTU_SHIFT17_MASK                              0x2
#define _CRCSHFTU_SHIFT18_POSN                              0x2
#define _CRCSHFTU_SHIFT18_POSITION                          0x2
#define _CRCSHFTU_SHIFT18_SIZE                              0x1
#define _CRCSHFTU_SHIFT18_LENGTH                            0x1
#define _CRCSHFTU_SHIFT18_MASK                              0x4
#define _CRCSHFTU_SHIFT19_POSN                              0x3
#define _CRCSHFTU_SHIFT19_POSITION                          0x3
#define _CRCSHFTU_SHIFT19_SIZE                              0x1
#define _CRCSHFTU_SHIFT19_LENGTH                            0x1
#define _CRCSHFTU_SHIFT19_MASK                              0x8
#define _CRCSHFTU_SHIFT20_POSN                              0x4
#define _CRCSHFTU_SHIFT20_POSITION                          0x4
#define _CRCSHFTU_SHIFT20_SIZE                              0x1
#define _CRCSHFTU_SHIFT20_LENGTH                            0x1
#define _CRCSHFTU_SHIFT20_MASK                              0x10
#define _CRCSHFTU_SHIFT21_POSN                              0x5
#define _CRCSHFTU_SHIFT21_POSITION                          0x5
#define _CRCSHFTU_SHIFT21_SIZE                              0x1
#define _CRCSHFTU_SHIFT21_LENGTH                            0x1
#define _CRCSHFTU_SHIFT21_MASK                              0x20
#define _CRCSHFTU_SHIFT22_POSN                              0x6
#define _CRCSHFTU_SHIFT22_POSITION                          0x6
#define _CRCSHFTU_SHIFT22_SIZE                              0x1
#define _CRCSHFTU_SHIFT22_LENGTH                            0x1
#define _CRCSHFTU_SHIFT22_MASK                              0x40
#define _CRCSHFTU_SHIFT23_POSN                              0x7
#define _CRCSHFTU_SHIFT23_POSITION                          0x7
#define _CRCSHFTU_SHIFT23_SIZE                              0x1
#define _CRCSHFTU_SHIFT23_LENGTH                            0x1
#define _CRCSHFTU_SHIFT23_MASK                              0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT16                :1;
        unsigned SHIFT17                :1;
        unsigned SHIFT18                :1;
        unsigned SHIFT19                :1;
        unsigned SHIFT20                :1;
        unsigned SHIFT21                :1;
        unsigned SHIFT22                :1;
        unsigned SHIFT23                :1;
    };
} CRCSHIFTUbits_t;
extern volatile CRCSHIFTUbits_t CRCSHIFTUbits __at(0x1CA3);
// bitfield macros
#define _CRCSHIFTU_SHIFT_POSN                               0x0
#define _CRCSHIFTU_SHIFT_POSITION                           0x0
#define _CRCSHIFTU_SHIFT_SIZE                               0x8
#define _CRCSHIFTU_SHIFT_LENGTH                             0x8
#define _CRCSHIFTU_SHIFT_MASK                               0xFF
#define _CRCSHIFTU_SHIFT16_POSN                             0x0
#define _CRCSHIFTU_SHIFT16_POSITION                         0x0
#define _CRCSHIFTU_SHIFT16_SIZE                             0x1
#define _CRCSHIFTU_SHIFT16_LENGTH                           0x1
#define _CRCSHIFTU_SHIFT16_MASK                             0x1
#define _CRCSHIFTU_SHIFT17_POSN                             0x1
#define _CRCSHIFTU_SHIFT17_POSITION                         0x1
#define _CRCSHIFTU_SHIFT17_SIZE                             0x1
#define _CRCSHIFTU_SHIFT17_LENGTH                           0x1
#define _CRCSHIFTU_SHIFT17_MASK                             0x2
#define _CRCSHIFTU_SHIFT18_POSN                             0x2
#define _CRCSHIFTU_SHIFT18_POSITION                         0x2
#define _CRCSHIFTU_SHIFT18_SIZE                             0x1
#define _CRCSHIFTU_SHIFT18_LENGTH                           0x1
#define _CRCSHIFTU_SHIFT18_MASK                             0x4
#define _CRCSHIFTU_SHIFT19_POSN                             0x3
#define _CRCSHIFTU_SHIFT19_POSITION                         0x3
#define _CRCSHIFTU_SHIFT19_SIZE                             0x1
#define _CRCSHIFTU_SHIFT19_LENGTH                           0x1
#define _CRCSHIFTU_SHIFT19_MASK                             0x8
#define _CRCSHIFTU_SHIFT20_POSN                             0x4
#define _CRCSHIFTU_SHIFT20_POSITION                         0x4
#define _CRCSHIFTU_SHIFT20_SIZE                             0x1
#define _CRCSHIFTU_SHIFT20_LENGTH                           0x1
#define _CRCSHIFTU_SHIFT20_MASK                             0x10
#define _CRCSHIFTU_SHIFT21_POSN                             0x5
#define _CRCSHIFTU_SHIFT21_POSITION                         0x5
#define _CRCSHIFTU_SHIFT21_SIZE                             0x1
#define _CRCSHIFTU_SHIFT21_LENGTH                           0x1
#define _CRCSHIFTU_SHIFT21_MASK                             0x20
#define _CRCSHIFTU_SHIFT22_POSN                             0x6
#define _CRCSHIFTU_SHIFT22_POSITION                         0x6
#define _CRCSHIFTU_SHIFT22_SIZE                             0x1
#define _CRCSHIFTU_SHIFT22_LENGTH                           0x1
#define _CRCSHIFTU_SHIFT22_MASK                             0x40
#define _CRCSHIFTU_SHIFT23_POSN                             0x7
#define _CRCSHIFTU_SHIFT23_POSITION                         0x7
#define _CRCSHIFTU_SHIFT23_SIZE                             0x1
#define _CRCSHIFTU_SHIFT23_LENGTH                           0x1
#define _CRCSHIFTU_SHIFT23_MASK                             0x80

// Register: CRCXORU
#define CRCXORU CRCXORU
extern volatile unsigned char           CRCXORU             __at(0x1CA3);
#ifndef _LIB_BUILD
asm("CRCXORU equ 01CA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned XOR                    :8;
    };
    struct {
        unsigned XOR16                  :1;
        unsigned XOR17                  :1;
        unsigned XOR18                  :1;
        unsigned XOR19                  :1;
        unsigned XOR20                  :1;
        unsigned XOR21                  :1;
        unsigned XOR22                  :1;
        unsigned XOR23                  :1;
    };
} CRCXORUbits_t;
extern volatile CRCXORUbits_t CRCXORUbits __at(0x1CA3);
// bitfield macros
#define _CRCXORU_XOR_POSN                                   0x0
#define _CRCXORU_XOR_POSITION                               0x0
#define _CRCXORU_XOR_SIZE                                   0x8
#define _CRCXORU_XOR_LENGTH                                 0x8
#define _CRCXORU_XOR_MASK                                   0xFF
#define _CRCXORU_XOR16_POSN                                 0x0
#define _CRCXORU_XOR16_POSITION                             0x0
#define _CRCXORU_XOR16_SIZE                                 0x1
#define _CRCXORU_XOR16_LENGTH                               0x1
#define _CRCXORU_XOR16_MASK                                 0x1
#define _CRCXORU_XOR17_POSN                                 0x1
#define _CRCXORU_XOR17_POSITION                             0x1
#define _CRCXORU_XOR17_SIZE                                 0x1
#define _CRCXORU_XOR17_LENGTH                               0x1
#define _CRCXORU_XOR17_MASK                                 0x2
#define _CRCXORU_XOR18_POSN                                 0x2
#define _CRCXORU_XOR18_POSITION                             0x2
#define _CRCXORU_XOR18_SIZE                                 0x1
#define _CRCXORU_XOR18_LENGTH                               0x1
#define _CRCXORU_XOR18_MASK                                 0x4
#define _CRCXORU_XOR19_POSN                                 0x3
#define _CRCXORU_XOR19_POSITION                             0x3
#define _CRCXORU_XOR19_SIZE                                 0x1
#define _CRCXORU_XOR19_LENGTH                               0x1
#define _CRCXORU_XOR19_MASK                                 0x8
#define _CRCXORU_XOR20_POSN                                 0x4
#define _CRCXORU_XOR20_POSITION                             0x4
#define _CRCXORU_XOR20_SIZE                                 0x1
#define _CRCXORU_XOR20_LENGTH                               0x1
#define _CRCXORU_XOR20_MASK                                 0x10
#define _CRCXORU_XOR21_POSN                                 0x5
#define _CRCXORU_XOR21_POSITION                             0x5
#define _CRCXORU_XOR21_SIZE                                 0x1
#define _CRCXORU_XOR21_LENGTH                               0x1
#define _CRCXORU_XOR21_MASK                                 0x20
#define _CRCXORU_XOR22_POSN                                 0x6
#define _CRCXORU_XOR22_POSITION                             0x6
#define _CRCXORU_XOR22_SIZE                                 0x1
#define _CRCXORU_XOR22_LENGTH                               0x1
#define _CRCXORU_XOR22_MASK                                 0x40
#define _CRCXORU_XOR23_POSN                                 0x7
#define _CRCXORU_XOR23_POSITION                             0x7
#define _CRCXORU_XOR23_SIZE                                 0x1
#define _CRCXORU_XOR23_LENGTH                               0x1
#define _CRCXORU_XOR23_MASK                                 0x80

// Register: CRCOUTT
#define CRCOUTT CRCOUTT
extern volatile unsigned char           CRCOUTT             __at(0x1CA4);
#ifndef _LIB_BUILD
asm("CRCOUTT equ 01CA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OUT                    :8;
    };
    struct {
        unsigned OUT24                  :1;
        unsigned OUT25                  :1;
        unsigned OUT26                  :1;
        unsigned OUT27                  :1;
        unsigned OUT28                  :1;
        unsigned OUT29                  :1;
        unsigned OUT30                  :1;
        unsigned OUT31                  :1;
    };
} CRCOUTTbits_t;
extern volatile CRCOUTTbits_t CRCOUTTbits __at(0x1CA4);
// bitfield macros
#define _CRCOUTT_OUT_POSN                                   0x0
#define _CRCOUTT_OUT_POSITION                               0x0
#define _CRCOUTT_OUT_SIZE                                   0x8
#define _CRCOUTT_OUT_LENGTH                                 0x8
#define _CRCOUTT_OUT_MASK                                   0xFF
#define _CRCOUTT_OUT24_POSN                                 0x0
#define _CRCOUTT_OUT24_POSITION                             0x0
#define _CRCOUTT_OUT24_SIZE                                 0x1
#define _CRCOUTT_OUT24_LENGTH                               0x1
#define _CRCOUTT_OUT24_MASK                                 0x1
#define _CRCOUTT_OUT25_POSN                                 0x1
#define _CRCOUTT_OUT25_POSITION                             0x1
#define _CRCOUTT_OUT25_SIZE                                 0x1
#define _CRCOUTT_OUT25_LENGTH                               0x1
#define _CRCOUTT_OUT25_MASK                                 0x2
#define _CRCOUTT_OUT26_POSN                                 0x2
#define _CRCOUTT_OUT26_POSITION                             0x2
#define _CRCOUTT_OUT26_SIZE                                 0x1
#define _CRCOUTT_OUT26_LENGTH                               0x1
#define _CRCOUTT_OUT26_MASK                                 0x4
#define _CRCOUTT_OUT27_POSN                                 0x3
#define _CRCOUTT_OUT27_POSITION                             0x3
#define _CRCOUTT_OUT27_SIZE                                 0x1
#define _CRCOUTT_OUT27_LENGTH                               0x1
#define _CRCOUTT_OUT27_MASK                                 0x8
#define _CRCOUTT_OUT28_POSN                                 0x4
#define _CRCOUTT_OUT28_POSITION                             0x4
#define _CRCOUTT_OUT28_SIZE                                 0x1
#define _CRCOUTT_OUT28_LENGTH                               0x1
#define _CRCOUTT_OUT28_MASK                                 0x10
#define _CRCOUTT_OUT29_POSN                                 0x5
#define _CRCOUTT_OUT29_POSITION                             0x5
#define _CRCOUTT_OUT29_SIZE                                 0x1
#define _CRCOUTT_OUT29_LENGTH                               0x1
#define _CRCOUTT_OUT29_MASK                                 0x20
#define _CRCOUTT_OUT30_POSN                                 0x6
#define _CRCOUTT_OUT30_POSITION                             0x6
#define _CRCOUTT_OUT30_SIZE                                 0x1
#define _CRCOUTT_OUT30_LENGTH                               0x1
#define _CRCOUTT_OUT30_MASK                                 0x40
#define _CRCOUTT_OUT31_POSN                                 0x7
#define _CRCOUTT_OUT31_POSITION                             0x7
#define _CRCOUTT_OUT31_SIZE                                 0x1
#define _CRCOUTT_OUT31_LENGTH                               0x1
#define _CRCOUTT_OUT31_MASK                                 0x80

